# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8-seg-p6 instance segmentation model. For Usage examples see https://docs.ultralytics.com/tasks/segment

# Parameters
nc: 6 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n-seg-p6.yaml' will call yolov8-seg-p6.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

depth_multiple: 0.33  # scales module repeats
width_multiple: 0.50  # scales convolution channels


# YOLOv8.0x6 backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C2f, [128, True]] # 2

  - [-11, 1, Conv, [64, 3, 2]] # 3-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 4-P2/4
  - [-1, 3, C2f, [128, True]] # 5

  - [[2,5], 1, GPT, [64]] # 6
  - [[2,6], 1, AddT, [64,0]] # 7
  - [[5,6], 1, AddT, [64,1]] # 8

  - [7, 1, Conv, [256, 3, 2]] # 9-P3/8
  - [-1, 6, C2f, [256, True]] # 10

  - [8, 1, Conv, [256, 3, 2]] # 11-P3/8
  - [-1, 6, C2f, [256, True]] # 12

  - [[10,12], 1, GPT, [128]] # 13
  - [[10,13], 1, AddT, [128,0]] # 14
  - [[12,13], 1, AddT, [128,1]] # 15

  - [14, 1, Conv, [512, 3, 2]] # 16
  - [-1, 6, C2f, [512, True]] # 17

  - [15, 1, Conv, [512, 3, 2]] # 18
  - [-1, 6, C2f, [512, True]] # 19

  - [[16,18], 1, GPT, [256]] # 20
  - [[16,20], 1, AddT, [256,0]] # 21
  - [[18,20], 1, AddT, [256,1]] # 22

  - [21, 1, Conv, [768, 3, 2]] # 23
  - [-1, 3, C2f, [768, True]] # 24
  - [-1, 1, Conv, [1024, 3, 2]] # 25-P6/64
  - [-1, 3, C2f, [1024, True]] # 26
  - [-1, 1, SPPF, [1024, 5]] # 27

  - [22, 1, Conv, [768, 3, 2]] # 28
  - [-1, 3, C2f, [768, True]] # 29
  - [-1, 1, Conv, [1024, 3, 2]] # 30-P6/64
  - [-1, 3, C2f, [1024, True]] # 31
  - [-1, 1, SPPF, [1024, 5]] # 32

  - [[24,29], 1, GPT, [384]] # 33
  - [[24,33], 1, AddT, [384,0]] # 34
  - [[29,33], 1, AddT, [384,1]] # 35

  - [[27,32], 1, GPT, [512]] # 36
  - [[27,36], 1, AddT, [512,0]] # 37
  - [[32,36], 1, AddT, [512,1]] # 38


  - [[7, 8], 1, Add, [64]] # 39
  - [[14, 15], 1, Add, [128]] # 40
  - [[21, 22], 1, Add, [256]] # 41 
  - [[34, 35], 1, Add, [384]] # 42
  - [[37, 38], 1, Add, [512]] # 43 

# YOLOv8.0x6 head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 44
  - [[-1, 42], 1, Concat, [1]] # 45 cat backbone P5
  - [-1, 3, C2, [768, False]] # 46

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 47
  - [[-1, 41], 1, Concat, [1]] # 48 cat backbone P4
  - [-1, 3, C2, [512, False]] # 49

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 50
  - [[-1, 40], 1, Concat, [1]] # 51 cat backbone P3
  - [-1, 3, C2, [256, False]] # 52 

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 53
  - [[-1, 39], 1, Concat, [1]] # 54 cat backbone P3
  - [-1, 3, C2, [128, False]] # 55 (P2/4-extra-small)

  - [-1, 1, Conv, [128, 3, 2]] # 56
  - [[-1, 52], 1, Concat, [1]] # 57 cat head P4
  - [-1, 3, C2, [256, False]] # 58 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]] # 59
  - [[-1, 49], 1, Concat, [1]] # 60 cat head P4
  - [-1, 3, C2, [512, False]] # 61 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]] # 62
  - [[-1, 46], 1, Concat, [1]] # 63 cat head P5
  - [-1, 3, C2, [768, False]] # 64 (P5/32-large)

  - [-1, 1, Conv, [768, 3, 2]] # 65
  - [[-1, 43], 1, Concat, [1]] # 66 cat head P6
  - [-1, 3, C2, [1024, False]] # 67 (P6/64-xlarge)

  - [[55, 58, 61, 64, 67], 1, Segment, [nc, 32, 256]] # 68 Pose(P2, P3, P4, P5, P6)
